# include <stdio.h>


//##########求 1 个数##########
int count_1(int x)
{
	//短除法求 1 的个数
	int count = 0;
	while (x)
	{
		if (x % 2 == 1)
			count++;
		x = x / 2;
	}
	return count;
}
int count_1_opt(int x) 
{
	//移位法求 1 的个数
	int count = 0;
	for (int i = 0; i < 32; i++)
	{
		if (1 == ((x >> i) & 1))
			count++;
	}
	return count;
}

void print_binary(unsigned int number) 
{
	//将 int 转化为二进制后打印出来。
	if (number >> 1)
		print_binary(number >> 1);
	putc((number & 1) ? '1' : '0', stdout);
}

//int main()
//{
//	//##########算数操作符##########
//	//int a = 5 / 2;
//	//printf("%d\n", a);//输出结果2
//	//double b = 5 / 2.0;
//	//double c = 5 / 2;
//	//printf("b = %lf c = %lf\n", b, c);//输出结果
//	////double mo = 5 % 2.0;//不合法
//
//	////##########移位操作符###########
//	//int a = 16;//二进制：00000000000000000000000000010000(32位)
//	//int b = a >> 1;//二进制：000000000000000000000000000001000
//	//printf("%d\n", b);// 8
//	////可以看到，右移一位有除以二的效果。
//
//	//a = -1;//1000...(24x0)...0001
//	//b = a >> 1;
//	//printf("%d\n", b);// -1
//	////可以看到，输出没有发生变化，因此是算数移位，也就是说保留了首位的 1.
//
//	////###########位操作符##########
//	//// & 按位与：有 1 则 1，同 1 才 1
//	//// | 按位或：有 0 则 0，同 0 才 0
//	//// ^ 按位异或：同则为 ，不同为 1
//	//int a = 3;//0x24 00000011
//	//int b = 9;//0x24 00001001
//	//// 3 & 9 = 0x24 00000001 = 1
//	//// 3 | 9 = 0x24 00001011 = 11
//	//// 3 ^ 9 = 0x24 00001010 = 10
//	//printf("a = 3, b = 9\n\na & b = %d\n\na | b = %d\n\na ^ b = %d\n", a & b, a | b, a ^ b);
//
//	////###########整型交换##########
//	//int a;
//	//int b;
//	//printf("交换前：a = %d  b = %d\n", a, b);
//	////int_swap(a, b);//利用位操作符完成两个整型的交换
//	//a = a ^ b;
//	//b = a ^ b;
//	//a = a ^ b;
//	//printf("交换后：a = %d  b = %d\n", a, b);
//
//	////##########求 1 个数##########
//	////思路：短除法
//	////取一个数字的每一位，例如十进制，那就%10，/10循环进行。对于二进制，那就是%2，/2
//	//int x = -1;
//	//int x_2 = 0;
//	//int count ;
//	////count = count_1(x);
//	//count = count_1_opt(x);
//	//printf("x = %d\n二进制：",x);
//	//print_binary(x);
//	//printf("\n1 的个数:%d\n",count);
//
//	//##########复合赋值符##########
//
//	//##########单目操作符##########
//	////sizeof
//	////tricky example
//	//short s = 0;
//	//int a = 10;
//	//printf("%d\n", sizeof(s = a + 5));
//	//printf("%d\n", s);
//	//// 打印结果是 2 0
//	//// sizeof 中的表达式是不参与运算的
//	//int a = 0;
//	//printf("%d\n", ~a); // -1
//
//	//// ++
//	//// 左 ++，右 ++
//	//int a = 0;
//	//printf("%d\n", ++a); //先 ++，再 print 1
//	//printf("%d\n", a++); //先 print 1，再 ++
//	//printf("%d\n", a); // 2
//
//	//// (int) (float) 强制类型转换
//	//int a = (int)3.14;
//	//printf("%d\n", a); // 3
//
//	//##########关系操作符##########
//
//	////#########逻辑操作符##########
//	//printf("%d\n", 3 && 4); // 1
//	////注意逻辑与和按位与的区别！
//
//
//}